Levi-5k/P4-walldisplay/sdkconfig.defaults
#
# Default sdkconfig values for Waveshare ESP32-P4 Smart 86 Box
#

# ---- Target ----------------------------------------------------------------
CONFIG_IDF_TARGET="esp32p4"

# ---- CPU / Clock -----------------------------------------------------------
# Our chip is rev v1.3 (REV_LESS_V3). In this mode rtc_clk_cpu_freq_mhz_to_config
# only supports 90/180/360 MHz; 400 MHz is rejected at runtime even if
# CONFIG_ESP_FORCE_400MHZ_ON_REV_LESS_V3 is enabled. So we explicitly pin 360.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360

# ---- Flash (external 32 MB NOR, QIO @ 80 MHz) ------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- PSRAM (in-package 32 MB HEX @ 200 MHz) --------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=196608

CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=65
CONFIG_LV_FS_STDIO_PATH="/"
CONFIG_LV_FS_STDIO_CACHE_SIZE=4096
CONFIG_LV_USE_TJPGD=y

# ---- SD / FATFS ------------------------------------------------------------
# The UI stores files such as weather/history.csv and background image paths;
# enable long filenames so FatFS does not reject those paths at runtime.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y

# ---- Compiler --------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ---- Wi-Fi/BT via ESP32-C6 co-processor (esp_wifi_remote / esp_hosted) -----
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
# CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE is not set

# ---- lwIP TCP tuning (throttle for SDIO Wi-Fi stability) -------------------
# Keep the receive window small to prevent TCP data bursts from overwhelming
# the ESP-Hosted SDIO write queue with ACK packets.
CONFIG_LWIP_TCP_WND_DEFAULT=2880
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6

# ---- FreeRTOS --------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# ---- Log -------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ---- Partition table (large app + storage for 32 MB flash) -----------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- MIPI-DSI panel (4" 720x720 IPS) ---------------------------------------
CONFIG_LCD_ENABLE_DEBUG_LOG=n

# ---- LVGL 9 + esp_lvgl_port ------------------------------------------------
# Color depth must match BSP_LCD_BIT_DEPTH (RGB565)
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=n
# Use C-lib malloc/string/sprintf (lets LVGL use PSRAM via heap_caps wrappers
# and shaves a few KB vs the LVGL built-ins).
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# Hot LVGL code in IRAM for smooth scrolling.
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
# Run the LVGL tick + rendering on FreeRTOS (esp_lvgl_port handles this).
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_TICK_CUSTOM=y
# 2 SW draw units => better use of the second HP core for rendering.
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_DRAW_SW_CIRCLE_CACHE_SIZE=16
# 15ms refresh => ~66 Hz, matches MIPI-DSI panel refresh cap.
CONFIG_LV_DEF_REFR_PERIOD=15
# Performance: cache decoded JPG backgrounds and style lookups.
CONFIG_LV_CACHE_DEF_SIZE=524288
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
# Built-in fonts used by ui_init / splash / weather / settings screens.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y

# ---- esp_lvgl_port task / buffer placement ---------------------------------
# Draw buffers in PSRAM (32 MB available), double-buffered, ~1/10 screen tall.
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# ---- Networking -----------------------------------------------------------
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# ---- Main task --------------------------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
